{
  "_name_or_path": "Xenova/quickdraw-mobilevit-small",
  "architectures": [
    "MobileViTForImageClassification"
  ],
  "aspp_dropout_prob": 0.1,
  "aspp_out_channels": 256,
  "atrous_rates": [
    6,
    12,
    18
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "conv_kernel_size": 3,
  "expand_ratio": 4.0,
  "hidden_act": "silu",
  "hidden_dropout_prob": 0.1,
  "hidden_sizes": [
    144,
    192,
    240
  ],
  "id2label": {
    "0": "aircraft carrier",
    "1": "airplane",
    "2": "alarm clock",
    "3": "ambulance",
    "4": "angel",
    "5": "animal migration",
    "6": "ant",
    "7": "anvil",
    "8": "apple",
    "9": "arm",
    "10": "asparagus",
    "11": "axe",
    "12": "backpack",
    "13": "banana",
    "14": "bandage",
    "15": "barn",
    "16": "baseball bat",
    "17": "baseball",
    "18": "basket",
    "19": "basketball",
    "20": "bat",
    "21": "bathtub",
    "22": "beach",
    "23": "bear",
    "24": "beard",
    "25": "bed",
    "26": "bee",
    "27": "belt",
    "28": "bench",
    "29": "bicycle",
    "30": "binoculars",
    "31": "bird",
    "32": "birthday cake",
    "33": "blackberry",
    "34": "blueberry",
    "35": "book",
    "36": "boomerang",
    "37": "bottlecap",
    "38": "bowtie",
    "39": "bracelet",
    "40": "brain",
    "41": "bread",
    "42": "bridge",
    "43": "broccoli",
    "44": "broom",
    "45": "bucket",
    "46": "bulldozer",
    "47": "bus",
    "48": "bush",
    "49": "butterfly",
    "50": "cactus",
    "51": "cake",
    "52": "calculator",
    "53": "calendar",
    "54": "camel",
    "55": "camera",
    "56": "camouflage",
    "57": "campfire",
    "58": "candle",
    "59": "cannon",
    "60": "canoe",
    "61": "car",
    "62": "carrot",
    "63": "castle",
    "64": "cat",
    "65": "ceiling fan",
    "66": "cell phone",
    "67": "cello",
    "68": "chair",
    "69": "chandelier",
    "70": "church",
    "71": "circle",
    "72": "clarinet",
    "73": "clock",
    "74": "cloud",
    "75": "coffee cup",
    "76": "compass",
    "77": "computer",
    "78": "cookie",
    "79": "cooler",
    "80": "couch",
    "81": "cow",
    "82": "crab",
    "83": "crayon",
    "84": "crocodile",
    "85": "crown",
    "86": "cruise ship",
    "87": "cup",
    "88": "diamond",
    "89": "dishwasher",
    "90": "diving board",
    "91": "dog",
    "92": "dolphin",
    "93": "donut",
    "94": "door",
    "95": "dragon",
    "96": "dresser",
    "97": "drill",
    "98": "drums",
    "99": "duck",
    "100": "dumbbell",
    "101": "ear",
    "102": "elbow",
    "103": "elephant",
    "104": "envelope",
    "105": "eraser",
    "106": "eye",
    "107": "eyeglasses",
    "108": "face",
    "109": "fan",
    "110": "feather",
    "111": "fence",
    "112": "finger",
    "113": "fire hydrant",
    "114": "fireplace",
    "115": "firetruck",
    "116": "fish",
    "117": "flamingo",
    "118": "flashlight",
    "119": "flip flops",
    "120": "floor lamp",
    "121": "flower",
    "122": "flying saucer",
    "123": "foot",
    "124": "fork",
    "125": "frog",
    "126": "frying pan",
    "127": "garden hose",
    "128": "garden",
    "129": "giraffe",
    "130": "goatee",
    "131": "golf club",
    "132": "grapes",
    "133": "grass",
    "134": "guitar",
    "135": "hamburger",
    "136": "hammer",
    "137": "hand",
    "138": "harp",
    "139": "hat",
    "140": "headphones",
    "141": "hedgehog",
    "142": "helicopter",
    "143": "helmet",
    "144": "hexagon",
    "145": "hockey puck",
    "146": "hockey stick",
    "147": "horse",
    "148": "hospital",
    "149": "hot air balloon",
    "150": "hot dog",
    "151": "hot tub",
    "152": "hourglass",
    "153": "house plant",
    "154": "house",
    "155": "hurricane",
    "156": "ice cream",
    "157": "jacket",
    "158": "jail",
    "159": "kangaroo",
    "160": "key",
    "161": "keyboard",
    "162": "knee",
    "163": "knife",
    "164": "ladder",
    "165": "lantern",
    "166": "laptop",
    "167": "leaf",
    "168": "leg",
    "169": "light bulb",
    "170": "lighter",
    "171": "lighthouse",
    "172": "lightning",
    "173": "line",
    "174": "lion",
    "175": "lipstick",
    "176": "lobster",
    "177": "lollipop",
    "178": "mailbox",
    "179": "map",
    "180": "marker",
    "181": "matches",
    "182": "megaphone",
    "183": "mermaid",
    "184": "microphone",
    "185": "microwave",
    "186": "monkey",
    "187": "moon",
    "188": "mosquito",
    "189": "motorbike",
    "190": "mountain",
    "191": "mouse",
    "192": "moustache",
    "193": "mouth",
    "194": "mug",
    "195": "mushroom",
    "196": "nail",
    "197": "necklace",
    "198": "nose",
    "199": "ocean",
    "200": "octagon",
    "201": "octopus",
    "202": "onion",
    "203": "oven",
    "204": "owl",
    "205": "paint can",
    "206": "paintbrush",
    "207": "palm tree",
    "208": "panda",
    "209": "pants",
    "210": "paper clip",
    "211": "parachute",
    "212": "parrot",
    "213": "passport",
    "214": "peanut",
    "215": "pear",
    "216": "peas",
    "217": "pencil",
    "218": "penguin",
    "219": "piano",
    "220": "pickup truck",
    "221": "picture frame",
    "222": "pig",
    "223": "pillow",
    "224": "pineapple",
    "225": "pizza",
    "226": "pliers",
    "227": "police car",
    "228": "pond",
    "229": "pool",
    "230": "popsicle",
    "231": "postcard",
    "232": "potato",
    "233": "power outlet",
    "234": "purse",
    "235": "rabbit",
    "236": "raccoon",
    "237": "radio",
    "238": "rain",
    "239": "rainbow",
    "240": "rake",
    "241": "remote control",
    "242": "rhinoceros",
    "243": "rifle",
    "244": "river",
    "245": "roller coaster",
    "246": "rollerskates",
    "247": "sailboat",
    "248": "sandwich",
    "249": "saw",
    "250": "saxophone",
    "251": "school bus",
    "252": "scissors",
    "253": "scorpion",
    "254": "screwdriver",
    "255": "sea turtle",
    "256": "see saw",
    "257": "shark",
    "258": "sheep",
    "259": "shoe",
    "260": "shorts",
    "261": "shovel",
    "262": "sink",
    "263": "skateboard",
    "264": "skull",
    "265": "skyscraper",
    "266": "sleeping bag",
    "267": "smiley face",
    "268": "snail",
    "269": "snake",
    "270": "snorkel",
    "271": "snowflake",
    "272": "snowman",
    "273": "soccer ball",
    "274": "sock",
    "275": "speedboat",
    "276": "spider",
    "277": "spoon",
    "278": "spreadsheet",
    "279": "square",
    "280": "squiggle",
    "281": "squirrel",
    "282": "stairs",
    "283": "star",
    "284": "steak",
    "285": "stereo",
    "286": "stethoscope",
    "287": "stitches",
    "288": "stop sign",
    "289": "stove",
    "290": "strawberry",
    "291": "streetlight",
    "292": "string bean",
    "293": "submarine",
    "294": "suitcase",
    "295": "sun",
    "296": "swan",
    "297": "sweater",
    "298": "swing set",
    "299": "sword",
    "300": "syringe",
    "301": "t-shirt",
    "302": "table",
    "303": "teapot",
    "304": "teddy-bear",
    "305": "telephone",
    "306": "television",
    "307": "tennis racquet",
    "308": "tent",
    "309": "The Eiffel Tower",
    "310": "The Great Wall of China",
    "311": "The Mona Lisa",
    "312": "tiger",
    "313": "toaster",
    "314": "toe",
    "315": "toilet",
    "316": "tooth",
    "317": "toothbrush",
    "318": "toothpaste",
    "319": "tornado",
    "320": "tractor",
    "321": "traffic light",
    "322": "train",
    "323": "tree",
    "324": "triangle",
    "325": "trombone",
    "326": "truck",
    "327": "trumpet",
    "328": "umbrella",
    "329": "underwear",
    "330": "van",
    "331": "vase",
    "332": "violin",
    "333": "washing machine",
    "334": "watermelon",
    "335": "waterslide",
    "336": "whale",
    "337": "wheel",
    "338": "windmill",
    "339": "wine bottle",
    "340": "wine glass",
    "341": "wristwatch",
    "342": "yoga",
    "343": "zebra",
    "344": "zigzag"
  },
  "ignore_mismatched_sizes": true,
  "image_size": 28,
  "initializer_range": 0.02,
  "label2id": {
    "The Eiffel Tower": "309",
    "The Great Wall of China": "310",
    "The Mona Lisa": "311",
    "aircraft carrier": "0",
    "airplane": "1",
    "alarm clock": "2",
    "ambulance": "3",
    "angel": "4",
    "animal migration": "5",
    "ant": "6",
    "anvil": "7",
    "apple": "8",
    "arm": "9",
    "asparagus": "10",
    "axe": "11",
    "backpack": "12",
    "banana": "13",
    "bandage": "14",
    "barn": "15",
    "baseball": "17",
    "baseball bat": "16",
    "basket": "18",
    "basketball": "19",
    "bat": "20",
    "bathtub": "21",
    "beach": "22",
    "bear": "23",
    "beard": "24",
    "bed": "25",
    "bee": "26",
    "belt": "27",
    "bench": "28",
    "bicycle": "29",
    "binoculars": "30",
    "bird": "31",
    "birthday cake": "32",
    "blackberry": "33",
    "blueberry": "34",
    "book": "35",
    "boomerang": "36",
    "bottlecap": "37",
    "bowtie": "38",
    "bracelet": "39",
    "brain": "40",
    "bread": "41",
    "bridge": "42",
    "broccoli": "43",
    "broom": "44",
    "bucket": "45",
    "bulldozer": "46",
    "bus": "47",
    "bush": "48",
    "butterfly": "49",
    "cactus": "50",
    "cake": "51",
    "calculator": "52",
    "calendar": "53",
    "camel": "54",
    "camera": "55",
    "camouflage": "56",
    "campfire": "57",
    "candle": "58",
    "cannon": "59",
    "canoe": "60",
    "car": "61",
    "carrot": "62",
    "castle": "63",
    "cat": "64",
    "ceiling fan": "65",
    "cell phone": "66",
    "cello": "67",
    "chair": "68",
    "chandelier": "69",
    "church": "70",
    "circle": "71",
    "clarinet": "72",
    "clock": "73",
    "cloud": "74",
    "coffee cup": "75",
    "compass": "76",
    "computer": "77",
    "cookie": "78",
    "cooler": "79",
    "couch": "80",
    "cow": "81",
    "crab": "82",
    "crayon": "83",
    "crocodile": "84",
    "crown": "85",
    "cruise ship": "86",
    "cup": "87",
    "diamond": "88",
    "dishwasher": "89",
    "diving board": "90",
    "dog": "91",
    "dolphin": "92",
    "donut": "93",
    "door": "94",
    "dragon": "95",
    "dresser": "96",
    "drill": "97",
    "drums": "98",
    "duck": "99",
    "dumbbell": "100",
    "ear": "101",
    "elbow": "102",
    "elephant": "103",
    "envelope": "104",
    "eraser": "105",
    "eye": "106",
    "eyeglasses": "107",
    "face": "108",
    "fan": "109",
    "feather": "110",
    "fence": "111",
    "finger": "112",
    "fire hydrant": "113",
    "fireplace": "114",
    "firetruck": "115",
    "fish": "116",
    "flamingo": "117",
    "flashlight": "118",
    "flip flops": "119",
    "floor lamp": "120",
    "flower": "121",
    "flying saucer": "122",
    "foot": "123",
    "fork": "124",
    "frog": "125",
    "frying pan": "126",
    "garden": "128",
    "garden hose": "127",
    "giraffe": "129",
    "goatee": "130",
    "golf club": "131",
    "grapes": "132",
    "grass": "133",
    "guitar": "134",
    "hamburger": "135",
    "hammer": "136",
    "hand": "137",
    "harp": "138",
    "hat": "139",
    "headphones": "140",
    "hedgehog": "141",
    "helicopter": "142",
    "helmet": "143",
    "hexagon": "144",
    "hockey puck": "145",
    "hockey stick": "146",
    "horse": "147",
    "hospital": "148",
    "hot air balloon": "149",
    "hot dog": "150",
    "hot tub": "151",
    "hourglass": "152",
    "house": "154",
    "house plant": "153",
    "hurricane": "155",
    "ice cream": "156",
    "jacket": "157",
    "jail": "158",
    "kangaroo": "159",
    "key": "160",
    "keyboard": "161",
    "knee": "162",
    "knife": "163",
    "ladder": "164",
    "lantern": "165",
    "laptop": "166",
    "leaf": "167",
    "leg": "168",
    "light bulb": "169",
    "lighter": "170",
    "lighthouse": "171",
    "lightning": "172",
    "line": "173",
    "lion": "174",
    "lipstick": "175",
    "lobster": "176",
    "lollipop": "177",
    "mailbox": "178",
    "map": "179",
    "marker": "180",
    "matches": "181",
    "megaphone": "182",
    "mermaid": "183",
    "microphone": "184",
    "microwave": "185",
    "monkey": "186",
    "moon": "187",
    "mosquito": "188",
    "motorbike": "189",
    "mountain": "190",
    "mouse": "191",
    "moustache": "192",
    "mouth": "193",
    "mug": "194",
    "mushroom": "195",
    "nail": "196",
    "necklace": "197",
    "nose": "198",
    "ocean": "199",
    "octagon": "200",
    "octopus": "201",
    "onion": "202",
    "oven": "203",
    "owl": "204",
    "paint can": "205",
    "paintbrush": "206",
    "palm tree": "207",
    "panda": "208",
    "pants": "209",
    "paper clip": "210",
    "parachute": "211",
    "parrot": "212",
    "passport": "213",
    "peanut": "214",
    "pear": "215",
    "peas": "216",
    "pencil": "217",
    "penguin": "218",
    "piano": "219",
    "pickup truck": "220",
    "picture frame": "221",
    "pig": "222",
    "pillow": "223",
    "pineapple": "224",
    "pizza": "225",
    "pliers": "226",
    "police car": "227",
    "pond": "228",
    "pool": "229",
    "popsicle": "230",
    "postcard": "231",
    "potato": "232",
    "power outlet": "233",
    "purse": "234",
    "rabbit": "235",
    "raccoon": "236",
    "radio": "237",
    "rain": "238",
    "rainbow": "239",
    "rake": "240",
    "remote control": "241",
    "rhinoceros": "242",
    "rifle": "243",
    "river": "244",
    "roller coaster": "245",
    "rollerskates": "246",
    "sailboat": "247",
    "sandwich": "248",
    "saw": "249",
    "saxophone": "250",
    "school bus": "251",
    "scissors": "252",
    "scorpion": "253",
    "screwdriver": "254",
    "sea turtle": "255",
    "see saw": "256",
    "shark": "257",
    "sheep": "258",
    "shoe": "259",
    "shorts": "260",
    "shovel": "261",
    "sink": "262",
    "skateboard": "263",
    "skull": "264",
    "skyscraper": "265",
    "sleeping bag": "266",
    "smiley face": "267",
    "snail": "268",
    "snake": "269",
    "snorkel": "270",
    "snowflake": "271",
    "snowman": "272",
    "soccer ball": "273",
    "sock": "274",
    "speedboat": "275",
    "spider": "276",
    "spoon": "277",
    "spreadsheet": "278",
    "square": "279",
    "squiggle": "280",
    "squirrel": "281",
    "stairs": "282",
    "star": "283",
    "steak": "284",
    "stereo": "285",
    "stethoscope": "286",
    "stitches": "287",
    "stop sign": "288",
    "stove": "289",
    "strawberry": "290",
    "streetlight": "291",
    "string bean": "292",
    "submarine": "293",
    "suitcase": "294",
    "sun": "295",
    "swan": "296",
    "sweater": "297",
    "swing set": "298",
    "sword": "299",
    "syringe": "300",
    "t-shirt": "301",
    "table": "302",
    "teapot": "303",
    "teddy-bear": "304",
    "telephone": "305",
    "television": "306",
    "tennis racquet": "307",
    "tent": "308",
    "tiger": "312",
    "toaster": "313",
    "toe": "314",
    "toilet": "315",
    "tooth": "316",
    "toothbrush": "317",
    "toothpaste": "318",
    "tornado": "319",
    "tractor": "320",
    "traffic light": "321",
    "train": "322",
    "tree": "323",
    "triangle": "324",
    "trombone": "325",
    "truck": "326",
    "trumpet": "327",
    "umbrella": "328",
    "underwear": "329",
    "van": "330",
    "vase": "331",
    "violin": "332",
    "washing machine": "333",
    "watermelon": "334",
    "waterslide": "335",
    "whale": "336",
    "wheel": "337",
    "windmill": "338",
    "wine bottle": "339",
    "wine glass": "340",
    "wristwatch": "341",
    "yoga": "342",
    "zebra": "343",
    "zigzag": "344"
  },
  "layer_norm_eps": 1e-05,
  "mlp_ratio": 2.0,
  "model_type": "mobilevit",
  "neck_hidden_sizes": [
    16,
    32,
    64,
    96,
    128,
    160,
    640
  ],
  "num_attention_heads": 4,
  "num_channels": 1,
  "output_stride": 32,
  "patch_size": 2,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "semantic_loss_ignore_index": 255,
  "transformers_version": "4.31.0.dev0"
}
