{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,128],"dtype":"int32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"embedding_Embedding1","class_name":"Embedding","config":{"input_dim":500,"output_dim":128,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":true,"input_length":null,"name":"embedding_Embedding1","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"conv1d_Conv1D1","class_name":"Conv1D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3],"strides":[1],"padding":"same","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D1","trainable":true},"inbound_nodes":[[["embedding_Embedding1",0,0,{}]]]},{"name":"global_max_pooling1d_GlobalMaxPooling1D1","class_name":"GlobalMaxPooling1D","config":{"name":"global_max_pooling1d_GlobalMaxPooling1D1","trainable":true},"inbound_nodes":[[["conv1d_Conv1D1",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":1024,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["global_max_pooling1d_GlobalMaxPooling1D1",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["dense_Dense1",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"embedding_Embedding1/embeddings","shape":[500,128],"dtype":"float32"},{"name":"conv1d_Conv1D1/kernel","shape":[3,128,256],"dtype":"float32"},{"name":"conv1d_Conv1D1/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[256,1024],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[1024],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}